app/controllers/api/events_controller.rb

SELECT "events".* FROM "events" ORDER BY "events"."event_date" DESC
---
    def index
      respond_with Event.order(event_date: :DESC)

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      respond_with Event.find(params[:id])

INSERT INTO "events" ("event_type", "event_date", "title", "speaker", "host", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create
      respond_with :api, Event.create(event_params)

DELETE FROM "events" WHERE "events"."id" = $1  [["id", 2]]
---
    def destroy
      respond_with Event.destroy(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "events" SET "event_type" = $1, "updated_at" = $2 WHERE "events"."id" = $3  [["event_type", "Hackathon2"], ["updated_at", "2019-09-17 13:33:09.776338"], ["id", 12]]
---
    def update
      event = Event.find(params['id'])
      event.update(event_params)